---
kind: method
id: M:Autodesk.Revit.DB.View.CanModifyDetailLevel
zh: 视图
source: html/78d27a7c-e5eb-6029-2fd4-4287cc84f09d.htm
---
# Autodesk.Revit.DB.View.CanModifyDetailLevel Method

**中文**: 视图

Check if Detail Level can be modified.

## Syntax (C#)
```csharp
public bool CanModifyDetailLevel()
```

## Returns
True if Detail Level can be modified.